[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:68:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="UCSBDates" id="appnavbar-ucsbdates-dropdown" data-testid="appnavbar-ucsbdates-dropdown" >
-                    <NavDropdown.Item href="/ucsbdates/list" data-testid="appnavbar-ucsbdates-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/ucsbdates/create" data-testid="appnavbar-ucsbdates-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                  
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="UCSBDates" id="appnavbar-ucsbdates-dropdown" data-testid="appnavbar-ucsbdates-dropdown">
+                    <NavDropdown.Item href="/ucsbdates/list" data-testid="appnavbar-ucsbdates-list">List</NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/ucsbdates/create" data-testid="appnavbar-ucsbdates-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the ucsbdates menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-ucsbdates-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:68:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="UCSBDates" id="appnavbar-ucsbdates-dropdown" data-testid="appnavbar-ucsbdates-dropdown" >
-                    <NavDropdown.Item href="/ucsbdates/list" data-testid="appnavbar-ucsbdates-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/ucsbdates/create" data-testid="appnavbar-ucsbdates-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                  
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders the ucsbdates menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-ucsbdates-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:84:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Course" id="appnavbar-course-dropdown" data-testid="appnavbar-course-dropdown" >
-                    <NavDropdown.Item href="/course/list" data-testid="appnavbar-course-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/course/create" data-testid="appnavbar-course-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Course" id="appnavbar-course-dropdown" data-testid="appnavbar-course-dropdown">
+                    <NavDropdown.Item href="/course/list" data-testid="appnavbar-course-list">List</NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/course/create" data-testid="appnavbar-course-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the course menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-course-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:84:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Course" id="appnavbar-course-dropdown" data-testid="appnavbar-course-dropdown" >
-                    <NavDropdown.Item href="/course/list" data-testid="appnavbar-course-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/course/create" data-testid="appnavbar-course-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders the course menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-course-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:88:23
                   <NavDropdown title="Course" id="appnavbar-course-dropdown" data-testid="appnavbar-course-dropdown" >
                     <NavDropdown.Item href="/course/list" data-testid="appnavbar-course-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/course/create" data-testid="appnavbar-course-create">Create</NavDropdown.Item>
-                      )
+                      true
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the course menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-course-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:88:23
                   <NavDropdown title="Course" id="appnavbar-course-dropdown" data-testid="appnavbar-course-dropdown" >
                     <NavDropdown.Item href="/course/list" data-testid="appnavbar-course-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/course/create" data-testid="appnavbar-course-create">Create</NavDropdown.Item>
-                      )
+                      hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown.Item href="/course/create" data-testid="appnavbar-course-create">Create</NavDropdown.Item>
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the course menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-course-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
