[Killed] BlockStatement
main/pages/Cars/CarCreatePage.js:6:41
 import { useNavigate } from 'react-router-dom'
 import { carUtils } from 'main/utils/carUtils';
 
-export default function CarCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (car) => {
-    const createdCar = carUtils.add(car);
-    console.log("createdCar: " + JSON.stringify(createdCar));
-    navigate("/cars");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Car</h1>
-        <CarForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function CarCreatePage() {}
 
killedBy: CarCreatePage tests renders without crashing
statusReason: Error: CarCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Cars/CarCreatePage.js:10:35
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (car) => {
-    const createdCar = carUtils.add(car);
-    console.log("createdCar: " + JSON.stringify(createdCar));
-    navigate("/cars");
-  }  
+  const onSubmit = async (car) => {}  
 
   return (
killedBy: CarCreatePage tests redirects to /cars on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Cars/CarCreatePage.js:12:17
 
   const onSubmit = async (car) => {
     const createdCar = carUtils.add(car);
-    console.log("createdCar: " + JSON.stringify(createdCar));
+    console.log("" + JSON.stringify(createdCar));
     navigate("/cars");
   }  
killedBy: CarCreatePage tests redirects to /cars on submit
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "createdCar: {\"car\":{\"id\":3,\"make\":\"Toyota\",\"model\":\"Camry\",\"year\":\"2022\"}"
Received string:    "{\"car\":{\"id\":3,\"make\":\"Toyota\",\"model\":\"Camry\",\"year\":\"2022\"}}"

[Killed] StringLiteral
main/pages/Cars/CarCreatePage.js:13:14
   const onSubmit = async (car) => {
     const createdCar = carUtils.add(car);
     console.log("createdCar: " + JSON.stringify(createdCar));
-    navigate("/cars");
+    navigate("");
   }  
 
killedBy: CarCreatePage tests redirects to /cars on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/cars"
Received: ""

Number of calls: 1

<html>
