[Killed] BlockStatement
main/pages/Cars/CarEditPage.js:9:39
 import { useNavigate } from 'react-router-dom'
 
 
-export default function CarEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = carUtils.getById(id);
-
-    const onSubmit = async (car) => {
-        const updatedCar = carUtils.update(car);
-        console.log("updatedCar: " + JSON.stringify(updatedCar));
-        navigate("/cars");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Car</h1>
-                <CarForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.car}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function CarEditPage() {}
killedBy: CarEditPage tests renders without crashing
statusReason: Error: CarEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Cars/CarEditPage.js:16:37
 
     const response = carUtils.getById(id);
 
-    const onSubmit = async (car) => {
-        const updatedCar = carUtils.update(car);
-        console.log("updatedCar: " + JSON.stringify(updatedCar));
-        navigate("/cars");
-    }  
+    const onSubmit = async (car) => {}  
 
     return (
killedBy: CarEditPage tests redirects to /cars on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Cars/CarEditPage.js:18:21
 
     const onSubmit = async (car) => {
         const updatedCar = carUtils.update(car);
-        console.log("updatedCar: " + JSON.stringify(updatedCar));
+        console.log("" + JSON.stringify(updatedCar));
         navigate("/cars");
     }  
killedBy: CarEditPage tests redirects to /cars on submit
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "updatedCar: {\"car\":{\"id\":3,\"make\":\"Toyota\",\"model\":\"Camry\",\"year\":\"2022\"}}"
Received string:    "{\"car\":{\"id\":3,\"make\":\"Toyota\",\"model\":\"Camry\",\"year\":\"2022\"}}"

[Killed] StringLiteral
main/pages/Cars/CarEditPage.js:26:63
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Car</h1>
-                <CarForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.car}/>
+                <CarForm submitAction={onSubmit} buttonLabel={""} initialContents={response.car}/>
             </div>
         </BasicLayout>
killedBy: CarEditPage tests redirects to /cars on submit
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
