[Killed] BlockStatement
src/main/utils/carUtils.js:1:19
-const get = () => {
-    const carValue = localStorage.getItem("cars");
-    if (carValue === undefined) {
-        const carCollection = { nextId: 1, cars: [] };
-        return set(carCollection);
-    }
-    const carCollection = JSON.parse(carValue);
-    if (carCollection === null) {
-        const carCollection = { nextId: 1, cars: [] };
-        return set(carCollection);
-    }
-    return carCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: carUtilities tests get When cars is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"cars": [], "nextId": 1}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/carUtils.js:3:9
 const get = () => {
     const carValue = localStorage.getItem("cars");
-    if (carValue === undefined) {
+    if (false) {
         const carCollection = { nextId: 1, cars: [] };
         return set(carCollection);
killedBy: carUtilities tests get When cars is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ConditionalExpression
src/main/utils/carUtils.js:3:9
 const get = () => {
     const carValue = localStorage.getItem("cars");
-    if (carValue === undefined) {
+    if (true) {
         const carCollection = { nextId: 1, cars: [] };
         return set(carCollection);
killedBy: carUtilities tests get When cars is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "cars", "{\"nextId\":1,\"cars\":[]}"

[Killed] EqualityOperator
src/main/utils/carUtils.js:8:9
         return set(carCollection);
     }
     const carCollection = JSON.parse(carValue);
-    if (carCollection === null) {
+    if (carCollection !== null) {
         const carCollection = { nextId: 1, cars: [] };
         return set(carCollection);
killedBy: carUtilities tests get When cars is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"cars": [], "nextId": 1}
Received: null

[Killed] ConditionalExpression
src/main/utils/carUtils.js:8:9
         return set(carCollection);
     }
     const carCollection = JSON.parse(carValue);
-    if (carCollection === null) {
+    if (true) {
         const carCollection = { nextId: 1, cars: [] };
         return set(carCollection);
killedBy: carUtilities tests get When cars is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "cars", "{\"nextId\":1,\"cars\":[]}"

[Killed] ArrayDeclaration
src/main/utils/carUtils.js:9:50
     }
     const carCollection = JSON.parse(carValue);
     if (carCollection === null) {
-        const carCollection = { nextId: 1, cars: [] };
+        const carCollection = { nextId: 1, cars: ["Stryker was here"] };
         return set(carCollection);
     }
killedBy: carUtilities tests get When cars is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "cars": Array [],
+   "cars": Array [

[Killed] BlockStatement
src/main/utils/carUtils.js:15:25
     return carCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const carCollection = get();
-    const cars = carCollection.cars;
-
-    /* eslint-disable-next-line eqeqeq */
-    const index = cars.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `car with id ${id} not found`};
-    }
-    return { car: cars[index] };
-};
+const getById = (id) => {};
 
 const set = (carCollection) => {
killedBy: carUtilities tests getById Check that getting a car by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"car": {"id": 3, "make": "Tesla", "model": "Model S", "year": "2021"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/carUtils.js:23:41
     const cars = carCollection.cars;
 
     /* eslint-disable-next-line eqeqeq */
-    const index = cars.findIndex((r) => r.id == id);
+    const index = cars.findIndex((r) => true);
     if (index === -1) {
         return { "error": `car with id ${id} not found`};
killedBy: carUtilities tests getById Check that getting a car by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "car": Object {
-     "id": 3,

[Killed] ConditionalExpression
src/main/utils/carUtils.js:23:41
     const cars = carCollection.cars;
 
     /* eslint-disable-next-line eqeqeq */
-    const index = cars.findIndex((r) => r.id == id);
+    const index = cars.findIndex((r) => false);
     if (index === -1) {
         return { "error": `car with id ${id} not found`};
killedBy: carUtilities tests getById Check that getting a car by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "car": Object {
-     "id": 3,

[Killed] EqualityOperator
src/main/utils/carUtils.js:24:9
 
     /* eslint-disable-next-line eqeqeq */
     const index = cars.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `car with id ${id} not found`};
     }
killedBy: carUtilities tests getById Check that getting a car by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "car": Object {
-     "id": 3,

[Killed] BlockStatement
src/main/utils/carUtils.js:24:23
 
     /* eslint-disable-next-line eqeqeq */
     const index = cars.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `car with id ${id} not found`};
-    }
+    if (index === -1) {}
     return { car: cars[index] };
 };
killedBy: carUtilities tests getById Check that getting a non-existing car returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "car with id 99 not found",
+   "car": undefined,

[Killed] ObjectLiteral
src/main/utils/carUtils.js:27:12
     if (index === -1) {
         return { "error": `car with id ${id} not found`};
     }
-    return { car: cars[index] };
+    return {};
 };
 
killedBy: carUtilities tests getById Check that getting a car by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "car": Object {
-     "id": 3,

[Killed] BlockStatement
src/main/utils/carUtils.js:30:32
     return { car: cars[index] };
 };
 
-const set = (carCollection) => {
-    localStorage.setItem("cars", JSON.stringify(carCollection));
-    return carCollection;
-};
+const set = (carCollection) => {};
 
 const add = (car) => {
killedBy: carUtilities tests get When cars is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"cars": [], "nextId": 1}
Received: undefined

[Killed] StringLiteral
src/main/utils/carUtils.js:31:26
 };
 
 const set = (carCollection) => {
-    localStorage.setItem("cars", JSON.stringify(carCollection));
+    localStorage.setItem("", JSON.stringify(carCollection));
     return carCollection;
 };
killedBy: carUtilities tests get When cars is undefined in local storage, should set to empty list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "cars", "{\"nextId\":1,\"cars\":[]}"
Received: "", "{\"nextId\":1,\"cars\":[]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/carUtils.js:35:22
     return carCollection;
 };
 
-const add = (car) => {
-    const carCollection = get();
-    car = { ...car, id: carCollection.nextId };
-    carCollection.nextId++;
-    carCollection.cars.push(car);
-    set(carCollection);
-    return car;
-};
+const add = (car) => {};
 
 const update = (car) => {
killedBy: carUtilities tests add Starting from [], check that adding one car works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": 1, "make": "Toyota", "model": "Camry", "year": "2022"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/carUtils.js:37:11
 
 const add = (car) => {
     const carCollection = get();
-    car = { ...car, id: carCollection.nextId };
+    car = {};
     carCollection.nextId++;
     carCollection.cars.push(car);
killedBy: carUtilities tests add Starting from [], check that adding one car works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "id": 1,
-   "make": "Toyota",

[Killed] UpdateOperator
src/main/utils/carUtils.js:38:5
 const add = (car) => {
     const carCollection = get();
     car = { ...car, id: carCollection.nextId };
-    carCollection.nextId++;
+    carCollection.nextId--;
     carCollection.cars.push(car);
     set(carCollection);
killedBy: carUtilities tests add Starting from [], check that adding one car works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "cars", "{\"nextId\":2,\"cars\":[{\"id\":1,\"make\":\"Toyota\",\"model\":\"Camry\",\"year\":\"2022\"}]}"
Received: "cars", "{\"nextId\":0,\"cars\":[{\"id\":1,\"make\":\"Toyota\",\"model\":\"Camry\",\"year\":\"2022\"}]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/carUtils.js:44:25
     return car;
 };
 
-const update = (car) => {
-    const carCollection = get();
-    const cars = carCollection.cars;
-
-    /* eslint-disable-next-line eqeqeq */
-    const index = cars.findIndex((r) => r.id == car.id);
-    if (index === -1) {
-        return { "error": `car with id ${car.id} not found` };
-    }
-    cars[index] = car;
-    set(carCollection);
-    return { carCollection: carCollection};
-};
+const update = (car) => {};
 
 const del = (id) => {
killedBy: carUtilities tests update Check that updating an existing car works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"carCollection": {"cars": [{"id": 2, "make": "Ford", "model": "Mustang", "name": "Updated Name", "year": "1969"}, {"id": 3, "make": "Tesla", "model": "Model S", "year": "2021"}, {"id": 4, "make": "BMW", "model": "M3", "year": "2021"}], "nextId": 5}}
Received: undefined

[Killed] ArrowFunction
src/main/utils/carUtils.js:49:34
     const cars = carCollection.cars;
 
     /* eslint-disable-next-line eqeqeq */
-    const index = cars.findIndex((r) => r.id == car.id);
+    const index = cars.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `car with id ${car.id} not found` };
killedBy: carUtilities tests update Check that updating an existing car works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

  Object {
-   "carCollection": Object {
-     "cars": Array [

[Killed] ConditionalExpression
src/main/utils/carUtils.js:49:41
     const cars = carCollection.cars;
 
     /* eslint-disable-next-line eqeqeq */
-    const index = cars.findIndex((r) => r.id == car.id);
+    const index = cars.findIndex((r) => false);
     if (index === -1) {
         return { "error": `car with id ${car.id} not found` };
killedBy: carUtilities tests update Check that updating an existing car works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

  Object {
-   "carCollection": Object {
-     "cars": Array [

[Killed] EqualityOperator
src/main/utils/carUtils.js:50:9
 
     /* eslint-disable-next-line eqeqeq */
     const index = cars.findIndex((r) => r.id == car.id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `car with id ${car.id} not found` };
     }
killedBy: carUtilities tests update Check that updating an existing car works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

  Object {
-   "carCollection": Object {
-     "cars": Array [

[Killed] ConditionalExpression
src/main/utils/carUtils.js:50:9
 
     /* eslint-disable-next-line eqeqeq */
     const index = cars.findIndex((r) => r.id == car.id);
-    if (index === -1) {
+    if (true) {
         return { "error": `car with id ${car.id} not found` };
     }
killedBy: carUtilities tests update Check that updating an existing car works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

  Object {
-   "carCollection": Object {
-     "cars": Array [

[Killed] BlockStatement
src/main/utils/carUtils.js:58:21
     return { carCollection: carCollection};
 };
 
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const carCollection = get();
-    const cars = carCollection.cars;
-
-    /* eslint-disable-next-line eqeqeq */
-    const index = cars.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `car with id ${id} not found` };
-    }
-    cars.splice(index, 1);
-    set(carCollection);
-    return { carCollection: carCollection };
-};
+const del = (id) => {};
 
 const carUtilities = {
killedBy: carUtilities tests del Check that deleting a car by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"carCollection": {"cars": [{"id": 2, "make": "Ford", "model": "Mustang", "year": "1969"}, {"id": 4, "make": "BMW", "model": "M3", "year": "2021"}], "nextId": 5}}
Received: undefined

[Killed] ArrowFunction
src/main/utils/carUtils.js:66:34
     const cars = carCollection.cars;
 
     /* eslint-disable-next-line eqeqeq */
-    const index = cars.findIndex((r) => r.id == id);
+    const index = cars.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `car with id ${id} not found` };
killedBy: carUtilities tests del Check that deleting a car by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "carCollection": Object {
-     "cars": Array [

[Killed] UnaryOperator
src/main/utils/carUtils.js:67:19
 
     /* eslint-disable-next-line eqeqeq */
     const index = cars.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `car with id ${id} not found` };
     }
killedBy: carUtilities tests del Check that deleting a car by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "carCollection": Object {
-     "cars": Array [

[Killed] ObjectLiteral
src/main/utils/carUtils.js:68:16
     /* eslint-disable-next-line eqeqeq */
     const index = cars.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `car with id ${id} not found` };
+        return {};
     }
     cars.splice(index, 1);
killedBy: carUtilities tests del Check that deleting a non-existing car returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "car with id 99 not found",
- }

[Killed] ObjectLiteral
src/main/utils/carUtils.js:75:22
     return { carCollection: carCollection };
 };
 
-const carUtilities = {
-    get,
-    getById,
-    add,
-    update,
-    del
-};
+const carUtilities = {};
 
 export { carUtilities };
killedBy: carUtilities tests get When cars is undefined in local storage, should set to empty list
statusReason: TypeError: _carUtils.carUtilities.get is not a function
