[Killed] BlockStatement
main/components/Courses/CourseTable.js:9:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    courseUtilities.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function CourseTable({
killedBy: CourseTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Courses/CourseTable.js:22:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/courses/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: CourseTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Courses/CourseTable.js:24:18
 
     const editCallback = (cell) => {
         console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/courses/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: CourseTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Courses/CourseTable.js:27:39
         navigate(`/courses/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/courses/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: CourseTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/details/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Courses/CourseTable.js:47:21
             accessor: 'courseNumber',
         },
         {
-            Header: 'Department',
+            Header: "",
             accessor: 'Department',
         }
killedBy: CourseTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: Department. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
