[Killed] BlockStatement
main/pages/Courses/CourseCreatePage.js:10:44
 import axios from "axios";
 import AxiosMockAdapter from "axios-mock-adapter";
 
-export default function CourseCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (course) => {
-    const createdCourse = courseUtilities.add(course);
-    console.log("createdCourse: " + JSON.stringify(createdCourse));
-    navigate("/courses");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Course</h1>
-        <CourseForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function CourseCreatePage() {}
 
killedBy: CourseCreatePage tests renders without crashing
statusReason: Error: CourseCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Courses/CourseCreatePage.js:14:38
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (course) => {
-    const createdCourse = courseUtilities.add(course);
-    console.log("createdCourse: " + JSON.stringify(createdCourse));
-    navigate("/courses");
-  }  
+  const onSubmit = async (course) => {}  
 
   return (
killedBy: CourseCreatePage tests redirects to /courses on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Courses/CourseCreatePage.js:17:14
   const onSubmit = async (course) => {
     const createdCourse = courseUtilities.add(course);
     console.log("createdCourse: " + JSON.stringify(createdCourse));
-    navigate("/courses");
+    navigate("");
   }  
 
killedBy: CourseCreatePage tests redirects to /courses on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses"
Received: ""

Number of calls: 1

<html>
