[Killed] BlockStatement
main/pages/Courses/CourseDetailsPage.js:10:45
 import axios from "axios";
 import AxiosMockAdapter from "axios-mock-adapter";
 
-export default function CourseDetailsPage() {
-  let { id } = useParams();
-
-  const response = courseUtilities.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Course Details</h1>
-        <CourseTable courses={[response.course]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function CourseDetailsPage() {}
 
killedBy: CourseDetailsPage tests renders without crashing
statusReason: Error: CourseDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Courses/CourseDetailsPage.js:19:63
     <BasicLayout>
       <div className="pt-2">
         <h1>Course Details</h1>
-        <CourseTable courses={[response.course]} showButtons={false} />
+        <CourseTable courses={[response.course]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: CourseDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="CourseTable-header-Delete"
  role="columnheader"
