[Killed] BlockStatement
main/pages/Courses/CourseEditPage.js:13:42
 import AxiosMockAdapter from "axios-mock-adapter";
 
 
-export default function CourseEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = courseUtilities.getById(id);
-
-    const onSubmit = async (course) => {
-        const updatedCourse = courseUtilities.update(course);
-        console.log("updatedCourse: " + JSON.stringify(updatedCourse));
-        navigate("/courses");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Course</h1>
-                <CourseForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.course}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function CourseEditPage() {}
killedBy: CourseEditPage tests renders without crashing
statusReason: Error: CourseEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Courses/CourseEditPage.js:20:40
 
     const response = courseUtilities.getById(id);
 
-    const onSubmit = async (course) => {
-        const updatedCourse = courseUtilities.update(course);
-        console.log("updatedCourse: " + JSON.stringify(updatedCourse));
-        navigate("/courses");
-    }  
+    const onSubmit = async (course) => {}  
 
     return (
killedBy: CourseEditPage tests redirects to /courses on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
