[Killed] BlockStatement
main/pages/Courses/CourseIndexPage.js:21:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`CourseIndexPage deleteCallback: ${showCell(cell)})`);
-        courseUtilities.del(cell.row.values.id);
-        navigate("/courses");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: CourseIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Courses/CourseIndexPage.js:30:41
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/courses/create">
+                <Button style={{ float: "" }} as={Link} to="/courses/create">
                     Create Course
                 </Button>
killedBy: CourseIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ObjectLiteral
main/pages/Courses/CourseIndexPage.js:30:32
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/courses/create">
+                <Button style={{}} as={Link} to="/courses/create">
                     Create Course
                 </Button>
killedBy: CourseIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
