[Killed] BlockStatement
src/main/utils/courseUtilities.js:1:19
-const get = () => {
-    const courseValue = localStorage.getItem("courses");
-    if (courseValue === undefined) {
-        const courseCollection = { nextId: 1, courses: [] };
-        return set(courseCollection);
-    }
-    const courseCollection = JSON.parse(courseValue);
-    if (courseCollection === null) {
-        const courseCollection = { nextId: 1, courses: [] };
-        return set(courseCollection);
-    }
-    return courseCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: CourseTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'courses')

[Killed] StringLiteral
src/main/utils/courseUtilities.js:2:46
 const get = () => {
-    const courseValue = localStorage.getItem("courses");
+    const courseValue = localStorage.getItem("");
     if (courseValue === undefined) {
         const courseCollection = { nextId: 1, courses: [] };
killedBy: courseUtilities tests get When courses is undefined in local storage, should set to empty list
statusReason: Error: Unexpected key:

[Killed] BlockStatement
src/main/utils/courseUtilities.js:3:36
 const get = () => {
     const courseValue = localStorage.getItem("courses");
-    if (courseValue === undefined) {
-        const courseCollection = { nextId: 1, courses: [] };
-        return set(courseCollection);
-    }
+    if (courseValue === undefined) {}
     const courseCollection = JSON.parse(courseValue);
     if (courseCollection === null) {
killedBy: courseUtilities tests get When courses is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ConditionalExpression
src/main/utils/courseUtilities.js:3:9
 const get = () => {
     const courseValue = localStorage.getItem("courses");
-    if (courseValue === undefined) {
+    if (false) {
         const courseCollection = { nextId: 1, courses: [] };
         return set(courseCollection);
killedBy: courseUtilities tests get When courses is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ConditionalExpression
src/main/utils/courseUtilities.js:8:9
         return set(courseCollection);
     }
     const courseCollection = JSON.parse(courseValue);
-    if (courseCollection === null) {
+    if (true) {
         const courseCollection = { nextId: 1, courses: [] };
         return set(courseCollection);
killedBy: courseUtilities tests get When courses is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "courses", "{\"nextId\":1,\"courses\":[]}"

[Killed] EqualityOperator
src/main/utils/courseUtilities.js:8:9
         return set(courseCollection);
     }
     const courseCollection = JSON.parse(courseValue);
-    if (courseCollection === null) {
+    if (courseCollection !== null) {
         const courseCollection = { nextId: 1, courses: [] };
         return set(courseCollection);
killedBy: CourseTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of null (reading 'courses')

[Killed] ObjectLiteral
src/main/utils/courseUtilities.js:9:34
     }
     const courseCollection = JSON.parse(courseValue);
     if (courseCollection === null) {
-        const courseCollection = { nextId: 1, courses: [] };
+        const courseCollection = {};
         return set(courseCollection);
     }
killedBy: CourseTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'findIndex')

[Killed] BlockStatement
src/main/utils/courseUtilities.js:15:25
     return courseCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const courseCollection = get();
-    const courses = courseCollection.courses;
-
-    /* eslint-disable-next-line eqeqeq */
-    const index = courses.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `course with id ${id} not found` };
-    }
-    return { course: courses[index] };
-};
+const getById = (id) => {};
 
 const set = (courseCollection) => {
killedBy: courseUtilities tests getById Check that getting a course by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"course": {"Department": "Isla Vista", "courseNumber": "18051 ", "id": 3, "title": "ENGL 24 - LOCAL AND GLOBAL"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/courseUtilities.js:23:44
     const courses = courseCollection.courses;
 
     /* eslint-disable-next-line eqeqeq */
-    const index = courses.findIndex((r) => r.id == id);
+    const index = courses.findIndex((r) => false);
     if (index === -1) {
         return { "error": `course with id ${id} not found` };
killedBy: courseUtilities tests getById Check that getting a course by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "course": Object {
-     "Department": "Isla Vista",

[Killed] EqualityOperator
src/main/utils/courseUtilities.js:23:44
     const courses = courseCollection.courses;
 
     /* eslint-disable-next-line eqeqeq */
-    const index = courses.findIndex((r) => r.id == id);
+    const index = courses.findIndex((r) => r.id != id);
     if (index === -1) {
         return { "error": `course with id ${id} not found` };
killedBy: courseUtilities tests getById Check that getting a course by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "course": Object {
-     "Department": "Isla Vista",

[Killed] BlockStatement
src/main/utils/courseUtilities.js:24:23
 
     /* eslint-disable-next-line eqeqeq */
     const index = courses.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `course with id ${id} not found` };
-    }
+    if (index === -1) {}
     return { course: courses[index] };
 };
killedBy: courseUtilities tests getById Check that getting a non-existing course returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "course with id 99 not found",
+   "course": undefined,

[Killed] ConditionalExpression
src/main/utils/courseUtilities.js:24:9
 
     /* eslint-disable-next-line eqeqeq */
     const index = courses.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (false) {
         return { "error": `course with id ${id} not found` };
     }
killedBy: courseUtilities tests getById Check that getting a non-existing course returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "course with id 99 not found",
+   "course": undefined,

[Killed] StringLiteral
src/main/utils/courseUtilities.js:25:27
     /* eslint-disable-next-line eqeqeq */
     const index = courses.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `course with id ${id} not found` };
+        return { "error": `` };
     }
     return { course: courses[index] };
killedBy: courseUtilities tests getById Check that getting a non-existing course returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "course with id 99 not found",
+   "error": "",

[Killed] BlockStatement
src/main/utils/courseUtilities.js:30:35
     return { course: courses[index] };
 };
 
-const set = (courseCollection) => {
-    localStorage.setItem("courses", JSON.stringify(courseCollection));
-    return courseCollection;
-};
+const set = (courseCollection) => {};
 
 const add = (course) => {
killedBy: courseUtilities tests get When courses is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"courses": [], "nextId": 1}
Received: undefined

[Killed] StringLiteral
src/main/utils/courseUtilities.js:31:26
 };
 
 const set = (courseCollection) => {
-    localStorage.setItem("courses", JSON.stringify(courseCollection));
+    localStorage.setItem("", JSON.stringify(courseCollection));
     return courseCollection;
 };
killedBy: courseUtilities tests get When courses is undefined in local storage, should set to empty list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "courses", "{\"nextId\":1,\"courses\":[]}"
Received: "", "{\"nextId\":1,\"courses\":[]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/courseUtilities.js:35:25
     return courseCollection;
 };
 
-const add = (course) => {
-    const courseCollection = get();
-    course = { ...course, id: courseCollection.nextId };
-    courseCollection.nextId++;
-    courseCollection.courses.push(course);
-    set(courseCollection);
-    return course;
-};
+const add = (course) => {};
 
 const update = (course) => {
killedBy: courseUtilities tests add Starting from [], check that adding one course works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"Department": "Computer Science", "courseNumber": "07427", "id": 1, "title": "CMPSC 156 - ADV APP PROGRAM"}
Received: undefined

[Killed] UpdateOperator
src/main/utils/courseUtilities.js:38:5
 const add = (course) => {
     const courseCollection = get();
     course = { ...course, id: courseCollection.nextId };
-    courseCollection.nextId++;
+    courseCollection.nextId--;
     courseCollection.courses.push(course);
     set(courseCollection);
killedBy: courseUtilities tests add Starting from [], check that adding one course works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "courses", "{\"nextId\":2,\"courses\":[{\"id\":1,\"title\":\"CMPSC 156 - ADV APP PROGRAM\",\"courseNumber\":\"07427\",\"Department\":\"Computer Science\"}]}"
Received: "courses", "{\"nextId\":0,\"courses\":[{\"id\":1,\"title\":\"CMPSC 156 - ADV APP PROGRAM\",\"courseNumber\":\"07427\",\"Department\":\"Computer Science\"}]}"

Num

[Killed] BlockStatement
src/main/utils/courseUtilities.js:44:28
     return course;
 };
 
-const update = (course) => {
-    const courseCollection = get();
-    const courses = courseCollection.courses;
-
-    /* eslint-disable-next-line eqeqeq */
-    const index = courses.findIndex((r) => r.id == course.id);
-    if (index === -1) {
-        return { "error": `course with id ${course.id} not found` };
-    }
-    courses[index] = course;
-    set(courseCollection);
-    return { courseCollection: courseCollection };
-};
+const update = (course) => {};
 
 const del = (id) => {
killedBy: courseUtilities tests update Check that updating an existing course works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ArrowFunction
src/main/utils/courseUtilities.js:49:37
     const courses = courseCollection.courses;
 
     /* eslint-disable-next-line eqeqeq */
-    const index = courses.findIndex((r) => r.id == course.id);
+    const index = courses.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `course with id ${course.id} not found` };
killedBy: courseUtilities tests update Check that updating an existing course works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

  Object {
-   "courseCollection": Object {
-     "courses": Array [

[Killed] EqualityOperator
src/main/utils/courseUtilities.js:49:44
     const courses = courseCollection.courses;
 
     /* eslint-disable-next-line eqeqeq */
-    const index = courses.findIndex((r) => r.id == course.id);
+    const index = courses.findIndex((r) => r.id != course.id);
     if (index === -1) {
         return { "error": `course with id ${course.id} not found` };
killedBy: courseUtilities tests update Check that updating an existing course works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -3,18 +3,18 @@
      "courses": Array [
        Object {

[Killed] ConditionalExpression
src/main/utils/courseUtilities.js:50:9
 
     /* eslint-disable-next-line eqeqeq */
     const index = courses.findIndex((r) => r.id == course.id);
-    if (index === -1) {
+    if (true) {
         return { "error": `course with id ${course.id} not found` };
     }
killedBy: courseUtilities tests update Check that updating an existing course works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

  Object {
-   "courseCollection": Object {
-     "courses": Array [

[Killed] UnaryOperator
src/main/utils/courseUtilities.js:50:19
 
     /* eslint-disable-next-line eqeqeq */
     const index = courses.findIndex((r) => r.id == course.id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `course with id ${course.id} not found` };
     }
killedBy: courseUtilities tests update Check that updating an non-existing course returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "course with id 99 not found",
+   "courseCollection": Object {

[Killed] StringLiteral
src/main/utils/courseUtilities.js:51:27
     /* eslint-disable-next-line eqeqeq */
     const index = courses.findIndex((r) => r.id == course.id);
     if (index === -1) {
-        return { "error": `course with id ${course.id} not found` };
+        return { "error": `` };
     }
     courses[index] = course;
killedBy: courseUtilities tests update Check that updating an non-existing course returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "course with id 99 not found",
+   "error": "",

[Killed] ObjectLiteral
src/main/utils/courseUtilities.js:55:12
     }
     courses[index] = course;
     set(courseCollection);
-    return { courseCollection: courseCollection };
+    return {};
 };
 
killedBy: courseUtilities tests update Check that updating an existing course works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 26
+ Received  +  1

- Object {
-   "courseCollection": Object {
-     "courses": Array [

[Killed] BlockStatement
src/main/utils/courseUtilities.js:58:21
     return { courseCollection: courseCollection };
 };
 
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const courseCollection = get();
-    const courses = courseCollection.courses;
-
-    /* eslint-disable-next-line eqeqeq */
-    const index = courses.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `course with id ${id} not found` };
-    }
-    courses.splice(index, 1);
-    set(courseCollection);
-    return { courseCollection: courseCollection };
-};
+const del = (id) => {};
 
 const courseUtilities = {
killedBy: courseUtilities tests del Check that deleting a course by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ArrowFunction
src/main/utils/courseUtilities.js:66:37
     const courses = courseCollection.courses;
 
     /* eslint-disable-next-line eqeqeq */
-    const index = courses.findIndex((r) => r.id == id);
+    const index = courses.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `course with id ${id} not found` };
killedBy: courseUtilities tests del Check that deleting a course by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "courseCollection": Object {
-     "courses": Array [

[Killed] ConditionalExpression
src/main/utils/courseUtilities.js:66:44
     const courses = courseCollection.courses;
 
     /* eslint-disable-next-line eqeqeq */
-    const index = courses.findIndex((r) => r.id == id);
+    const index = courses.findIndex((r) => true);
     if (index === -1) {
         return { "error": `course with id ${id} not found` };
killedBy: courseUtilities tests del Check that deleting a course by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,13 +1,13 @@
  Object {
    "courseCollection": Object {

[Killed] UnaryOperator
src/main/utils/courseUtilities.js:67:19
 
     /* eslint-disable-next-line eqeqeq */
     const index = courses.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `course with id ${id} not found` };
     }
killedBy: courseUtilities tests del Check that deleting a course by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "courseCollection": Object {
-     "courses": Array [

[Killed] ObjectLiteral
src/main/utils/courseUtilities.js:68:16
     /* eslint-disable-next-line eqeqeq */
     const index = courses.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `course with id ${id} not found` };
+        return {};
     }
     courses.splice(index, 1);
killedBy: courseUtilities tests del Check that deleting a non-existing course returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "course with id 99 not found",
- }

[Killed] ObjectLiteral
src/main/utils/courseUtilities.js:75:25
     return { courseCollection: courseCollection };
 };
 
-const courseUtilities = {
-    get,
-    getById,
-    add,
-    update,
-    del
-};
+const courseUtilities = {};
 
 export { courseUtilities };
killedBy: courseUtilities tests get When courses is undefined in local storage, should set to empty list
statusReason: TypeError: _courseUtilities.courseUtilities.get is not a function
