[Killed] StringLiteral
main/components/UCSBDates/UCSBDateForm.js:7:68
 import { useNavigate } from 'react-router-dom'
 
 
-function UCSBDateForm({ initialUCSBDate, submitAction, buttonLabel="Create" }) {
+function UCSBDateForm({ initialUCSBDate, submitAction, buttonLabel="" }) {
 
     // Stryker disable all
killedBy: UCSBDateForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
