[Killed] BlockStatement
main/components/UCSBDates/UCSBDatesTable.js:12:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ucsbdates/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbdates/edit/1"

Number of calls: 0

<html>
  <head />
