[Killed] ArrowFunction
main/pages/UCSBDates/UCSBDatesCreatePage.js:9:31
 
 export default function UCSBDatesCreatePage() {
 
-  const objectToAxiosParams = (ucsbDate) => ({
-    url: "/api/ucsbdates/post",
-    method: "POST",
-    params: {
-      quarterYYYYQ: ucsbDate.quarterYYYYQ,
-      name: ucsbDate.name,
-      localDateTime: ucsbDate.localDateTime
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbDate) => {
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesCreatePage.js:19:35
     }
   });
 
-  const onSuccess = (ucsbDate) => {
-    toast(`New ucsbDate Created - id: ${ucsbDate.id} name: ${ucsbDate.name}`);
-  }
+  const onSuccess = (ucsbDate) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbDate Created - id: 17 name: Groundhog Day"

Number of calls: 0

[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesCreatePage.js:32:36
 
   const { isSuccess } = mutation
 
-  const onSubmit = async (data) => {
-    mutation.mutate(data);
-  }
+  const onSubmit = async (data) => {}
 
   if (isSuccess) {
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesCreatePage.js:36:18
     mutation.mutate(data);
   }
 
-  if (isSuccess) {
-    return <Navigate to="/ucsbdates/list" />
-  }
+  if (isSuccess) {}
 
   return (
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdates/list"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/UCSBDates/UCSBDatesCreatePage.js:36:7
     mutation.mutate(data);
   }
 
-  if (isSuccess) {
+  if (false) {
     return <Navigate to="/ucsbdates/list" />
   }
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdates/list"}

Number of calls: 0
