[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesEditPage.js:15:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/ucsbdates?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/ucsbdates`,
-        params: {
-          id
-        }
-      }
+      {}
     );
 
killedBy: UCSBDatesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDateForm-quarterYYYYQ"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesEditPage.js:18:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/ucsbdates`,
-        params: {
-          id
-        }
+        params: {}
       }
     );
killedBy: UCSBDatesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDateForm-quarterYYYYQ"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBDates/UCSBDatesEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (ucsbDate) => ({
-    url: "/api/ucsbdates",
-    method: "PUT",
-    params: {
-      id: ucsbDate.id,
-    },
-    data: {
-      quarterYYYYQ: ucsbDate.quarterYYYYQ,
-      name: ucsbDate.name,
-      localDateTime: ucsbDate.localDateTime
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbDate) => {
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDate Updated - id: 17 name: Christmas Morning"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesEditPage.js:25:49
     );
 
 
-  const objectToAxiosPutParams = (ucsbDate) => ({
-    url: "/api/ucsbdates",
-    method: "PUT",
-    params: {
-      id: ucsbDate.id,
-    },
-    data: {
-      quarterYYYYQ: ucsbDate.quarterYYYYQ,
-      name: ucsbDate.name,
-      localDateTime: ucsbDate.localDateTime
-    }
-  });
+  const objectToAxiosPutParams = (ucsbDate) => ({});
 
   const onSuccess = (ucsbDate) => {
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDate Updated - id: 17 name: Christmas Morning"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesEditPage.js:38:35
     }
   });
 
-  const onSuccess = (ucsbDate) => {
-    toast(`UCSBDate Updated - id: ${ucsbDate.id} name: ${ucsbDate.name}`);
-  }
+  const onSuccess = (ucsbDate) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDate Updated - id: 17 name: Christmas Morning"

Number of calls: 0

[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesEditPage.js:44:5
 
   const mutation = useBackendMutation(
     objectToAxiosPutParams,
-    { onSuccess },
+    {},
     // Stryker disable next-line all : hard to set up test for caching
     [`/api/ucsbdates?id=${id}`]
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDate Updated - id: 17 name: Christmas Morning"

Number of calls: 0

[Killed] LogicalOperator
main/pages/UCSBDates/UCSBDatesEditPage.js:63:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDate</h1>
-        {ucsbDate &&
-          <UCSBDateForm initialUCSBDate={ucsbDate} submitAction={onSubmit} buttonLabel="Update" />
+        {ucsbDate || <UCSBDateForm initialUCSBDate={ucsbDate} submitAction={onSubmit} buttonLabel="Update" />
         }
       </div>
killedBy: UCSBDatesEditPage tests when the backend doesn't return a todo renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBDateForm-quarterYYYYQ" id="quarterYYYYQ" name="quarterYYYYQ" type="text" /> instead

[Killed] ConditionalExpression
main/pages/UCSBDates/UCSBDatesEditPage.js:63:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDate</h1>
-        {ucsbDate &&
-          <UCSBDateForm initialUCSBDate={ucsbDate} submitAction={onSubmit} buttonLabel="Update" />
+        {false
         }
       </div>
killedBy: UCSBDatesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDateForm-quarterYYYYQ"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
