[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesIndexPage.js:8:46
 import UCSBDatesTable from 'main/components/UCSBDates/UCSBDatesTable';
 import { useCurrentUser } from 'main/utils/currentUser'
 
-export default function UCSBDatesIndexPage() {
-
-  const currentUser = useCurrentUser();
-
-  const { data: dates, error: _error, status: _status } =
-    useBackend(
-      // Stryker disable next-line all : don't test internal caching of React Query
-      ["/api/ucsbdates/all"],
-      { method: "GET", url: "/api/ucsbdates/all" },
-      []
-    );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>UCSBDates</h1>
-        <UCSBDatesTable dates={dates} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function UCSBDatesIndexPage() {}
killedBy: UCSBDatesIndexPage tests renders without crashing for regular user
statusReason: Error: UCSBDatesIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/UCSBDates/UCSBDatesIndexPage.js:16:17
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/ucsbdates/all"],
-      { method: "GET", url: "/api/ucsbdates/all" },
+      { method: "", url: "/api/ucsbdates/all" },
       []
     );
killedBy: UCSBDatesIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/ucsbdates/all"
Received string:    "Error communicating with backend via  on /api/ucsbdates/all"
