[Killed] ArrowFunction
main/components/Restaurants/RestaurantTable.js:6:18
 import { useNavigate } from "react-router-dom";
 import { restaurantUtils } from "main/utils/restaurantUtils";
 
-const showCell = (cell) => JSON.stringify(cell.row.values);
+const showCell = () => undefined;
 
 
killedBy: RestaurantTable tests showCell function works properly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"a\":1,\"b\":2,\"c\":3}"
Received: undefined

[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:9:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    restaurantUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function RestaurantTable({
killedBy: RestaurantTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BooleanLiteral
main/components/Restaurants/RestaurantTable.js:17:19
 export default function RestaurantTable({
     restaurants,
     deleteCallback = defaultDeleteCallback,
-    showButtons = true,
+    showButtons = false,
     testIdPrefix = "RestaurantTable" }) {
 
killedBy: RestaurantTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-Details-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:22:36
 
     const navigate = useNavigate();
  
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/restaurants/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: RestaurantTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:23:21
     const navigate = useNavigate();
  
     const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
+        console.log(``);
         navigate(`/restaurants/edit/${cell.row.values.id}`)
     }
killedBy: RestaurantTable tests Edit button navigates to the edit page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "editCallback: {\"id\":2,\"name\":\"Cristino's Bakery\",\"description\":\"This place is takeout only.  It may look mostly like a bakery with Mexican pastries, but it also has amazing burritos and tacos\"})"
Received string:    ""

[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:27:39
         navigate(`/restaurants/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/restaurants/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: RestaurantTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/details/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:28:21
     }
 
     const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
+        console.log(``);
         navigate(`/restaurants/details/${cell.row.values.id}`)
     }
killedBy: RestaurantTable tests Details button navigates to the details page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "detailsCallback: {\"id\":2,\"name\":\"Cristino's Bakery\",\"description\":\"This place is takeout only.  It may look mostly like a bakery with Mexican pastries, but it also has amazing burritos and tacos\"})"
Received string:    ""

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:29:18
 
     const detailsCallback = (cell) => {
         console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/restaurants/details/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: RestaurantTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/details/2"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:34:21
 
     const columns = [
         {
-            Header: 'id',
+            Header: "",
             accessor: 'id', // accessor is the "key" in the data
         },
killedBy: RestaurantTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Restaurants/RestaurantTable.js:42:9
             Header: 'Name',
             accessor: 'name',
         },
-        {
-            Header: 'Description',
-            accessor: 'description',
-        }
+        {}
     ];
 
killedBy: RestaurantTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:50:22
 
     const buttonColumns = [
         ...columns,
-        ButtonColumn("Details", "primary", detailsCallback, testIdPrefix),
+        ButtonColumn("", "primary", detailsCallback, testIdPrefix),
         ButtonColumn("Edit", "primary", editCallback, testIdPrefix),
         ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: RestaurantTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!
