[Killed] BlockStatement
main/pages/Restaurants/RestaurantsDetailsPage.js:6:49
 import RestaurantTable from 'main/components/Restaurants/RestaurantTable';
 import { restaurantUtils } from 'main/utils/restaurantUtils';
 
-export default function RestaurantDetailsPage() {
-  let { id } = useParams();
-
-  const response = restaurantUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Restaurant Details</h1>
-        <RestaurantTable restaurants={[response.restaurant]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RestaurantDetailsPage() {}
 
killedBy: RestaurantDetailsPage tests renders without crashing
statusReason: Error: RestaurantDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Restaurants/RestaurantsDetailsPage.js:15:75
     <BasicLayout>
       <div className="pt-2">
         <h1>Restaurant Details</h1>
-        <RestaurantTable restaurants={[response.restaurant]} showButtons={false} />
+        <RestaurantTable restaurants={[response.restaurant]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: RestaurantDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="RestaurantTable-header-Delete"
  role="columnheader"

[Killed] ArrayDeclaration
main/pages/Restaurants/RestaurantsDetailsPage.js:15:39
     <BasicLayout>
       <div className="pt-2">
         <h1>Restaurant Details</h1>
-        <RestaurantTable restaurants={[response.restaurant]} showButtons={false} />
+        <RestaurantTable restaurants={[]} showButtons={false} />
       </div>
     </BasicLayout>
killedBy: RestaurantDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: Freebirds. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
