[Killed] BlockStatement
main/pages/Restaurants/RestaurantsEditPage.js:9:46
 import { useNavigate } from 'react-router-dom'
 
 
-export default function RestaurantEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = restaurantUtils.getById(id);
-
-    const onSubmit = async (restaurant) => {
-        const updatedRestaurant = restaurantUtils.update(restaurant);
-        console.log("updatedRestaurant: " + JSON.stringify(updatedRestaurant));
-        navigate("/restaurants");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Restaurant</h1>
-                <RestaurantForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.restaurant}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function RestaurantEditPage() {}
killedBy: RestaurantEditPage tests renders without crashing
statusReason: Error: RestaurantEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Restaurants/RestaurantsEditPage.js:16:44
 
     const response = restaurantUtils.getById(id);
 
-    const onSubmit = async (restaurant) => {
-        const updatedRestaurant = restaurantUtils.update(restaurant);
-        console.log("updatedRestaurant: " + JSON.stringify(updatedRestaurant));
-        navigate("/restaurants");
-    }  
+    const onSubmit = async (restaurant) => {}  
 
     return (
killedBy: RestaurantEditPage tests redirects to /restaurants on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Restaurants/RestaurantsEditPage.js:18:21
 
     const onSubmit = async (restaurant) => {
         const updatedRestaurant = restaurantUtils.update(restaurant);
-        console.log("updatedRestaurant: " + JSON.stringify(updatedRestaurant));
+        console.log("" + JSON.stringify(updatedRestaurant));
         navigate("/restaurants");
     }  
killedBy: RestaurantEditPage tests redirects to /restaurants on submit
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "updatedRestaurant: {\"restaurant\":{\"id\":3,\"name\":\"South Coast Deli (Goleta)\",\"description\":\"Sandwiches, Salads and more\"}"
Received string:    "{\"restaurant\":{\"id\":3,\"name\":\"South Coast Deli (Goleta)\",\"description\":\"Sandwiches, Salads and more\"}}"

[Killed] StringLiteral
main/pages/Restaurants/RestaurantsEditPage.js:26:70
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Restaurant</h1>
-                <RestaurantForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.restaurant}/>
+                <RestaurantForm submitAction={onSubmit} buttonLabel={""} initialContents={response.restaurant}/>
             </div>
         </BasicLayout>
killedBy: RestaurantEditPage tests redirects to /restaurants on submit
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
