[Killed] BlockStatement
main/pages/Restaurants/RestaurantsIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`RestaurantIndexPage deleteCallback: ${showCell(cell)})`);
-        restaurantUtils.del(cell.row.values.id);
-        navigate("/restaurants");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: RestaurantIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
