[Killed] BlockStatement
main/pages/Todos/TodosCreatePage.js:3:43
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function TodosCreatePage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Todos</h1>
-        <p>
-          This is where the create page will go
-        </p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function TodosCreatePage() {}
killedBy: TodosCreatePage tests renders without crashing
statusReason: Error: TodosCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
