[Killed] BlockStatement
main/pages/Todos/TodosEditPage.js:3:41
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function TodosEditPage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Todos</h1>
-        <p>
-          This is where the edit page will go
-        </p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function TodosEditPage() {}
killedBy: TodosCreatePage tests renders without crashing
statusReason: Error: TodosEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
