[Killed] BlockStatement
main/pages/Todos/TodosIndexPage.js:3:42
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function TodosIndexPage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Todos</h1>
-        <p>
-          This is where the index page will go
-        </p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function TodosIndexPage() {}
killedBy: TodosIndexPage tests renders without crashing
statusReason: Error: TodosIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
