[Killed] BlockStatement
src/main/utils/restaurantUtils.js:2:19
 // get restaurants from local storage
-const get = () => {
-    const restaurantValue = localStorage.getItem("restaurants");
-    if (restaurantValue === undefined) {
-        const restaurantCollection = { nextId: 1, restaurants: [] }
-        return set(restaurantCollection);
-    }
-    const restaurantCollection = JSON.parse(restaurantValue);
-    if (restaurantCollection === null) {
-        const restaurantCollection = { nextId: 1, restaurants: [] }
-        return set(restaurantCollection);
-    }
-    return restaurantCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: RestaurantTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'restaurants')

[Killed] BlockStatement
src/main/utils/restaurantUtils.js:4:40
 // get restaurants from local storage
 const get = () => {
     const restaurantValue = localStorage.getItem("restaurants");
-    if (restaurantValue === undefined) {
-        const restaurantCollection = { nextId: 1, restaurants: [] }
-        return set(restaurantCollection);
-    }
+    if (restaurantValue === undefined) {}
     const restaurantCollection = JSON.parse(restaurantValue);
     if (restaurantCollection === null) {
killedBy: restaurantUtils tests get When restaurants is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ConditionalExpression
src/main/utils/restaurantUtils.js:4:9
 // get restaurants from local storage
 const get = () => {
     const restaurantValue = localStorage.getItem("restaurants");
-    if (restaurantValue === undefined) {
+    if (true) {
         const restaurantCollection = { nextId: 1, restaurants: [] }
         return set(restaurantCollection);
killedBy: restaurantUtils tests get When restaurants is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "restaurants", "{\"nextId\":1,\"restaurants\":[]}"

[Killed] ArrayDeclaration
src/main/utils/restaurantUtils.js:5:64
 const get = () => {
     const restaurantValue = localStorage.getItem("restaurants");
     if (restaurantValue === undefined) {
-        const restaurantCollection = { nextId: 1, restaurants: [] }
+        const restaurantCollection = { nextId: 1, restaurants: ["Stryker was here"] }
         return set(restaurantCollection);
     }
killedBy: restaurantUtils tests get When restaurants is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
    "nextId": 1,
-   "restaurants": Array [],

[Killed] ConditionalExpression
src/main/utils/restaurantUtils.js:9:9
         return set(restaurantCollection);
     }
     const restaurantCollection = JSON.parse(restaurantValue);
-    if (restaurantCollection === null) {
+    if (true) {
         const restaurantCollection = { nextId: 1, restaurants: [] }
         return set(restaurantCollection);
killedBy: restaurantUtils tests get When restaurants is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "restaurants", "{\"nextId\":1,\"restaurants\":[]}"

[Killed] EqualityOperator
src/main/utils/restaurantUtils.js:9:9
         return set(restaurantCollection);
     }
     const restaurantCollection = JSON.parse(restaurantValue);
-    if (restaurantCollection === null) {
+    if (restaurantCollection !== null) {
         const restaurantCollection = { nextId: 1, restaurants: [] }
         return set(restaurantCollection);
killedBy: restaurantUtils tests get When restaurants is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "restaurants": []}
Received: null

[Killed] ArrayDeclaration
src/main/utils/restaurantUtils.js:10:64
     }
     const restaurantCollection = JSON.parse(restaurantValue);
     if (restaurantCollection === null) {
-        const restaurantCollection = { nextId: 1, restaurants: [] }
+        const restaurantCollection = { nextId: 1, restaurants: ["Stryker was here"] }
         return set(restaurantCollection);
     }
killedBy: restaurantUtils tests get When restaurants is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
    "nextId": 1,
-   "restaurants": Array [],

[Killed] BlockStatement
src/main/utils/restaurantUtils.js:16:25
     return restaurantCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const restaurantCollection = get();
-    const restaurants = restaurantCollection.restaurants;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = restaurants.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `restaurant with id ${id} not found` };
-    }
-    return { restaurant: restaurants[index] };
-}
+const getById = (id) => {}
 
 // set restaurants in local storage
killedBy: restaurantUtils tests getById Check that getting a restaurant by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"restaurant": {"address": "879 Embarcadero del Norte", "city": "Isla Vista", "description": "Burrito joint, and iconic Isla Vista location", "id": 3, "name": "Freebirds", "state": "CA", "zip": "93117"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/restaurantUtils.js:17:9
 };
 
 const getById = (id) => {
-    if (id === undefined) {
+    if (false) {
         return { "error": "id is a required parameter" };
     }
killedBy: restaurantUtils tests getById Check that an error is returned when id not passed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "id is a required parameter",
+   "error": "restaurant with id undefined not found",

[Killed] BlockStatement
src/main/utils/restaurantUtils.js:17:27
 };
 
 const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
+    if (id === undefined) {}
     const restaurantCollection = get();
     const restaurants = restaurantCollection.restaurants;
killedBy: restaurantUtils tests getById Check that an error is returned when id not passed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "id is a required parameter",
+   "error": "restaurant with id undefined not found",

[Killed] ConditionalExpression
src/main/utils/restaurantUtils.js:24:48
     const restaurants = restaurantCollection.restaurants;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = restaurants.findIndex((r) => r.id == id);
+    const index = restaurants.findIndex((r) => false);
     if (index === -1) {
         return { "error": `restaurant with id ${id} not found` };
killedBy: restaurantUtils tests getById Check that getting a restaurant by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

  Object {
-   "restaurant": Object {
-     "address": "879 Embarcadero del Norte",

[Killed] ConditionalExpression
src/main/utils/restaurantUtils.js:24:48
     const restaurants = restaurantCollection.restaurants;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = restaurants.findIndex((r) => r.id == id);
+    const index = restaurants.findIndex((r) => true);
     if (index === -1) {
         return { "error": `restaurant with id ${id} not found` };
killedBy: restaurantUtils tests getById Check that getting a restaurant by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Object {
    "restaurant": Object {
-     "address": "879 Embarcadero del Norte",

[Killed] ConditionalExpression
src/main/utils/restaurantUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = restaurants.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (false) {
         return { "error": `restaurant with id ${id} not found` };
     }
killedBy: restaurantUtils tests getById Check that getting a non-existing restaurant returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "restaurant with id 99 not found",
+   "restaurant": undefined,

[Killed] EqualityOperator
src/main/utils/restaurantUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = restaurants.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `restaurant with id ${id} not found` };
     }
killedBy: restaurantUtils tests getById Check that getting a restaurant by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

  Object {
-   "restaurant": Object {
-     "address": "879 Embarcadero del Norte",

[Killed] StringLiteral
src/main/utils/restaurantUtils.js:26:27
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = restaurants.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `restaurant with id ${id} not found` };
+        return { "error": `` };
     }
     return { restaurant: restaurants[index] };
killedBy: restaurantUtils tests getById Check that getting a non-existing restaurant returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "restaurant with id 99 not found",
+   "error": "",

[Killed] BlockStatement
src/main/utils/restaurantUtils.js:32:39
 }
 
 // set restaurants in local storage
-const set = (restaurantCollection) => {
-    localStorage.setItem("restaurants", JSON.stringify(restaurantCollection));
-    return restaurantCollection;
-};
+const set = (restaurantCollection) => {};
 
 // add a restaurant to local storage
killedBy: restaurantUtils tests get When restaurants is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "restaurants": []}
Received: undefined

[Killed] BlockStatement
src/main/utils/restaurantUtils.js:38:29
 };
 
 // add a restaurant to local storage
-const add = (restaurant) => {
-    const restaurantCollection = get();
-    restaurant = { ...restaurant, id: restaurantCollection.nextId };
-    restaurantCollection.nextId++;
-    restaurantCollection.restaurants.push(restaurant);
-    set(restaurantCollection);
-    return restaurant;
-};
+const add = (restaurant) => {};
 
 // update a restaurant in local storage
killedBy: restaurantUtils tests add Starting from [], check that adding one restaurant works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"address": "888 Embarcadero del Norte", "city": "Isla Vista", "description": "Burgers and Fries", "id": 1, "name": "The Habit", "state": "CA", "zip": "93117"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/restaurantUtils.js:40:18
 // add a restaurant to local storage
 const add = (restaurant) => {
     const restaurantCollection = get();
-    restaurant = { ...restaurant, id: restaurantCollection.nextId };
+    restaurant = {};
     restaurantCollection.nextId++;
     restaurantCollection.restaurants.push(restaurant);
killedBy: restaurantUtils tests add Starting from [], check that adding one restaurant works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

- Object {
-   "address": "888 Embarcadero del Norte",
-   "city": "Isla Vista",

[Killed] UpdateOperator
src/main/utils/restaurantUtils.js:41:5
 const add = (restaurant) => {
     const restaurantCollection = get();
     restaurant = { ...restaurant, id: restaurantCollection.nextId };
-    restaurantCollection.nextId++;
+    restaurantCollection.nextId--;
     restaurantCollection.restaurants.push(restaurant);
     set(restaurantCollection);
killedBy: restaurantUtils tests add Starting from [], check that adding one restaurant works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "restaurants", "{\"nextId\":2,\"restaurants\":[{\"id\":1,\"name\":\"The Habit\",\"address\":\"888 Embarcadero del Norte\",\"city\":\"Isla Vista\",\"state\":\"CA\",\"zip\":\"93117\",\"description\":\"Burgers and Fries\"}]}"
Received: "restaurants", "{\"nextId\":0,\"restaurants\":[{\"id\":1,\"name\":\"The Habit\",\"address\":\"888

[Killed] BlockStatement
src/main/utils/restaurantUtils.js:48:32
 };
 
 // update a restaurant in local storage
-const update = (restaurant) => {
-    const restaurantCollection = get();
-
-    const restaurants = restaurantCollection.restaurants;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = restaurants.findIndex((r) => r.id == restaurant.id);
-    if (index === -1) {
-        return { "error": `restaurant with id ${restaurant.id} not found` };
-    }
-    restaurants[index] = restaurant;
-    set(restaurantCollection);
-    return { restaurantCollection: restaurantCollection };
-};
+const update = (restaurant) => {};
 
 // delete a restaurant from local storage
killedBy: restaurantUtils tests update Check that updating an existing restaurant works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ArrowFunction
src/main/utils/restaurantUtils.js:54:41
     const restaurants = restaurantCollection.restaurants;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = restaurants.findIndex((r) => r.id == restaurant.id);
+    const index = restaurants.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `restaurant with id ${restaurant.id} not found` };
killedBy: restaurantUtils tests update Check that updating an existing restaurant works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 32
+ Received  +  1

  Object {
-   "restaurantCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/restaurantUtils.js:54:48
     const restaurants = restaurantCollection.restaurants;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = restaurants.findIndex((r) => r.id == restaurant.id);
+    const index = restaurants.findIndex((r) => false);
     if (index === -1) {
         return { "error": `restaurant with id ${restaurant.id} not found` };
killedBy: restaurantUtils tests update Check that updating an existing restaurant works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 32
+ Received  +  1

  Object {
-   "restaurantCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/restaurantUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = restaurants.findIndex((r) => r.id == restaurant.id);
-    if (index === -1) {
+    if (true) {
         return { "error": `restaurant with id ${restaurant.id} not found` };
     }
killedBy: restaurantUtils tests update Check that updating an existing restaurant works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 32
+ Received  +  1

  Object {
-   "restaurantCollection": Object {
-     "nextId": 5,

[Killed] BlockStatement
src/main/utils/restaurantUtils.js:55:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = restaurants.findIndex((r) => r.id == restaurant.id);
-    if (index === -1) {
-        return { "error": `restaurant with id ${restaurant.id} not found` };
-    }
+    if (index === -1) {}
     restaurants[index] = restaurant;
     set(restaurantCollection);
killedBy: restaurantUtils tests update Check that updating an non-existing restaurant returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 32

  Object {
-   "error": "restaurant with id 99 not found",
+   "restaurantCollection": Object {

[Killed] BlockStatement
src/main/utils/restaurantUtils.js:64:21
 };
 
 // delete a restaurant from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const restaurantCollection = get();
-    const restaurants = restaurantCollection.restaurants;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = restaurants.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `restaurant with id ${id} not found` };
-    }
-    restaurants.splice(index, 1);
-    set(restaurantCollection);
-    return { restaurantCollection: restaurantCollection };
-};
+const del = (id) => {};
 
 const restaurantUtils = {
killedBy: restaurantUtils tests del Check that deleting a restaurant by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] EqualityOperator
src/main/utils/restaurantUtils.js:65:9
 
 // delete a restaurant from local storage
 const del = (id) => {
-    if (id === undefined) {
+    if (id !== undefined) {
         return { "error": "id is a required parameter" };
     }
killedBy: restaurantUtils tests del Check that deleting a restaurant by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "restaurantCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/restaurantUtils.js:65:9
 
 // delete a restaurant from local storage
 const del = (id) => {
-    if (id === undefined) {
+    if (true) {
         return { "error": "id is a required parameter" };
     }
killedBy: restaurantUtils tests del Check that deleting a restaurant by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "restaurantCollection": Object {
-     "nextId": 5,

[Killed] ObjectLiteral
src/main/utils/restaurantUtils.js:74:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = restaurants.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `restaurant with id ${id} not found` };
+        return {};
     }
     restaurants.splice(index, 1);
killedBy: restaurantUtils tests del Check that deleting a non-existing restaurant returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "restaurant with id 99 not found",
- }

[Killed] ObjectLiteral
src/main/utils/restaurantUtils.js:78:12
     }
     restaurants.splice(index, 1);
     set(restaurantCollection);
-    return { restaurantCollection: restaurantCollection };
+    return {};
 };
 
killedBy: restaurantUtils tests del Check that deleting a restaurant by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 25
+ Received  +  1

- Object {
-   "restaurantCollection": Object {
-     "nextId": 5,
